import requests

apikey = '7d94224ada019dbff5390249379b9ffe51a8547a'
iin = '1027739471517'

url = f'https://api-fns.ru/api/check?req={iin}&key={apikey}'
ans = requests.get(url).text

print(ans)

# {"items":
#     [{"ЮЛ":
#         {"ОГРН":"1027739471517",
#          "ИНН":"7719190113",
#          "Позитив":{},
#          "Негатив":
#              {"Статус":"Ликвидировано по 129-ФЗ (02.04.2018)",
#               "НедостоверАдрес":"Да",
#               "МассРук":"Да (617 юрлиц)",
#               "РукЛиквКомп":"Да (618 юрлиц)",
#               "НедостоверРук":"Да",
#               "Текст":"Ликвидировано по 129-ФЗ (02.04.2018); Недостоверный адрес; Массовый руководитель (617 действ. юрлиц); Руководитель в ликвидированных компаниях (618 юрлиц); Недостоверный руководитель"
#               }
#         }
#     }]
#  }